app/controllers/comments_controller.rb

INSERT INTO "comments" ("approved", "author", "author_email", "author_url", "commentable_id", "commentable_type", "content", "created_at", "referrer", "updated_at", "user_agent", "user_ip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @comment = @commentable.comments.new(comment_params)
    if @comment.save