app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    authorize @post
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author_id", "body", "created_at", "published", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author_id", nil], ["body", "love rails"], ["created_at", Wed, 23 Oct 2013 18:05:51 UTC +00:00], ["published", true], ["title", "i"], ["updated_at", Wed, 23 Oct 2013 18:05:51 UTC +00:00]]

  def update
    authorize @post
    respond_to do |format|
      if @post.update_attributes(post_params)
---
UPDATE "posts" SET "title" = 'First post', "updated_at" = '2013-11-19 20:53:59.233837' WHERE "posts"."id" = 1

  def destroy
    authorize @post
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]