app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("created_at", "name", "technologies_used", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 24 Oct 2013 22:14:33 UTC +00:00], ["name", "ajsdklasj"], ["technologies_used", "lasjdflkasjf;laskdjfa"], ["updated_at", Thu, 24 Oct 2013 22:14:33 UTC +00:00]]

  def update
    if @project.update_attributes(project_params)
---
UPDATE "projects" SET "name" = 'My Rad Portfolio', "technologies_used" = '